_load_testing/bench.txt
Running 3s warmup @ http://localhost:3333/checkout/create
1 connections

Running 30s test @ http://localhost:3333/checkout/create
500 connections

┌─────────┬─────────┬─────────┬─────────┬─────────┬────────────┬──────────┬─────────┐
│ Stat    │ 2.5%    │ 50%     │ 97.5%   │ 99%     │ Avg        │ Stdev    │ Max     │
├─────────┼─────────┼─────────┼─────────┼─────────┼────────────┼──────────┼─────────┤
│ Latency │ 3001 ms │ 3008 ms │ 3107 ms │ 3109 ms │ 3018.65 ms │ 30.09 ms │ 3117 ms │
└─────────┴─────────┴─────────┴─────────┴─────────┴────────────┴──────────┴─────────┘
┌───────────┬─────┬──────┬─────┬────────┬─────────┬─────────┬────────┐
│ Stat      │ 1%  │ 2.5% │ 50% │ 97.5%  │ Avg     │ Stdev   │ Min    │
├───────────┼─────┼──────┼─────┼────────┼─────────┼─────────┼────────┤
│ Req/Sec   │ 0   │ 0    │ 0   │ 500    │ 150     │ 229,13  │ 500    │
├───────────┼─────┼──────┼─────┼────────┼─────────┼─────────┼────────┤
│ Bytes/Sec │ 0 B │ 0 B  │ 0 B │ 119 kB │ 35.5 kB │ 54.3 kB │ 119 kB │
└───────────┴─────┴──────┴─────┴────────┴─────────┴─────────┴────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 201  │ 4500  │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 30

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 3000         │
├────────────┼──────────────┤
│ 0.01       │ 3000         │
├────────────┼──────────────┤
│ 0.1        │ 3000         │
├────────────┼──────────────┤
│ 1          │ 3001         │
├────────────┼──────────────┤
│ 2.5        │ 3001         │
├────────────┼──────────────┤
│ 10         │ 3003         │
├────────────┼──────────────┤
│ 25         │ 3006         │
├────────────┼──────────────┤
│ 50         │ 3008         │
├────────────┼──────────────┤
│ 75         │ 3014         │
├────────────┼──────────────┤
│ 90         │ 3094         │
├────────────┼──────────────┤
│ 97.5       │ 3107         │
├────────────┼──────────────┤
│ 99         │ 3109         │
├────────────┼──────────────┤
│ 99.9       │ 3115         │
├────────────┼──────────────┤
│ 99.99      │ 3117         │
├────────────┼──────────────┤
│ 99.999     │ 3117         │
└────────────┴──────────────┘

5k requests in 30.16s, 1.07 MB read