_load_testing/cluster.txt
Running 2s warmup @ http://localhost:3333/checkout/create
1 connections
5 workers

Running 15s test @ http://localhost:3333/checkout/create
500 connections
5 workers

-
┌─────────┬──────┬──────┬───────┬───────┬─────────┬──────────┬────────┐
│ Stat    │ 2.5% │ 50%  │ 97.5% │ 99%   │ Avg     │ Stdev    │ Max    │
├─────────┼──────┼──────┼───────┼───────┼─────────┼──────────┼────────┤
│ Latency │ 1 ms │ 3 ms │ 41 ms │ 70 ms │ 6.45 ms │ 13.98 ms │ 939 ms │
└─────────┴──────┴──────┴───────┴───────┴─────────┴──────────┴────────┘
┌───────────┬─────────┬─────────┬────────┬────────┬───────────┬───────────┬─────────┐    
│ Stat      │ 1%      │ 2.5%    │ 50%    │ 97.5%  │ Avg       │ Stdev     │ Min     │    
├───────────┼─────────┼─────────┼────────┼────────┼───────────┼───────────┼─────────┤    
│ Req/Sec   │ 27.471  │ 27.471  │ 73.151 │ 94.975 │ 72.000,54 │ 16.082,96 │ 27.471  │    
├───────────┼─────────┼─────────┼────────┼────────┼───────────┼───────────┼─────────┤    
│ Bytes/Sec │ 6.37 MB │ 6.37 MB │ 17 MB  │ 22 MB  │ 16.7 MB   │ 3.73 MB   │ 6.37 MB │    
└───────────┴─────────┴─────────┴────────┴────────┴───────────┴───────────┴─────────┘    
┌──────┬─────────┐
│ Code │ Count   │
├──────┼─────────┤
│ 200  │ 1079964 │
└──────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 75

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 0            │
├────────────┼──────────────┤
│ 0.01       │ 0            │
├────────────┼──────────────┤
│ 0.1        │ 0            │
├────────────┼──────────────┤
│ 1          │ 0            │
├────────────┼──────────────┤
│ 2.5        │ 1            │
├────────────┼──────────────┤
│ 10         │ 1            │
├────────────┼──────────────┤
│ 25         │ 2            │
├────────────┼──────────────┤
│ 50         │ 3            │
├────────────┼──────────────┤
│ 75         │ 5            │
├────────────┼──────────────┤
│ 90         │ 12           │
├────────────┼──────────────┤
│ 97.5       │ 41           │
├────────────┼──────────────┤
│ 99         │ 70           │
├────────────┼──────────────┤
│ 99.9       │ 134          │
├────────────┼──────────────┤
│ 99.99      │ 370          │
├────────────┼──────────────┤
│ 99.999     │ 857          │
└────────────┴──────────────┘

1080k requests in 15.03s, 251 MB read