_load_testing/no-cluster.txt
Running 2s warmup @ http://localhost:3333/checkout/create
1 connections
5 workers

Running 15s test @ http://localhost:3333/checkout/create
500 connections
5 workers

-
┌─────────┬───────┬───────┬───────┬────────┬─────────┬──────────┬────────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5% │ 99%    │ Avg     │ Stdev    │ Max    │
├─────────┼───────┼───────┼───────┼────────┼─────────┼──────────┼────────┤
│ Latency │ 14 ms │ 17 ms │ 87 ms │ 142 ms │ 22.8 ms │ 22.45 ms │ 421 ms │
└─────────┴───────┴───────┴───────┴────────┴─────────┴──────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬──────────┬──────────┬─────────┐    
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg      │ Stdev    │ Min     │    
├───────────┼─────────┼─────────┼─────────┼─────────┼──────────┼──────────┼─────────┤    
│ Req/Sec   │ 16.047  │ 16.047  │ 28.751  │ 33.375  │ 27.250,4 │ 4.365,37 │ 16.044  │    
├───────────┼─────────┼─────────┼─────────┼─────────┼──────────┼──────────┼─────────┤    
│ Bytes/Sec │ 3.72 MB │ 3.72 MB │ 6.67 MB │ 7.74 MB │ 6.32 MB  │ 1.01 MB  │ 3.72 MB │    
└───────────┴─────────┴─────────┴─────────┴─────────┴──────────┴──────────┴─────────┘    
┌──────┬────────┐
│ Code │ Count  │
├──────┼────────┤
│ 200  │ 408730 │
└──────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 75

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 0            │
├────────────┼──────────────┤
│ 0.01       │ 0            │
├────────────┼──────────────┤
│ 0.1        │ 2            │
├────────────┼──────────────┤
│ 1          │ 13           │
├────────────┼──────────────┤
│ 2.5        │ 14           │
├────────────┼──────────────┤
│ 10         │ 14           │
├────────────┼──────────────┤
│ 25         │ 15           │
├────────────┼──────────────┤
│ 50         │ 17           │
├────────────┼──────────────┤
│ 75         │ 21           │
├────────────┼──────────────┤
│ 90         │ 32           │
├────────────┼──────────────┤
│ 97.5       │ 87           │
├────────────┼──────────────┤
│ 99         │ 142          │
├────────────┼──────────────┤
│ 99.9       │ 219          │
├────────────┼──────────────┤
│ 99.99      │ 371          │
├────────────┼──────────────┤
│ 99.999     │ 416          │
└────────────┴──────────────┘

409k requests in 15.06s, 94.8 MB read
135 errors (0 timeouts)